'use strict';
Дз:
Написать следующие программы на js. Одна программа - один js файл:
1) написать программу, реализующую метод решения квадратного уравнения вида:
a*x*x + b*x + c = 0
через дискриминант. Вывести в консоль результат решения (x1, x2). Если у
уравнения нет решений (D<0) ,
то вывести в консоль «нет решений». Коэффициенты уравнения (a, b, c) можно
выбрать любые.

2) В заданном массиве из 5 чисел (числа можно выбрать любые) найти максимальный
 и минимальный элемент
 массива. Вывести их в консоль.
  
3) Создать массив объектов user с полями name, password, salary. Найти всех
пользователей, имена
 которых начинаются на заданную букву(выбрать самому) и вывести их в консоль.
 Найти пользователя с наибольшей
 зарплатой (salary) и вывести его в консоль. Найти сумму зарплат всех
 пользователей и вывести ее
  в консоль. Массив можно сгенерировать при помощи сервиса генерации «фиктивных»
  данных https://mockaroo.com/

4*) Отсортировать заданный массив из 10 чисел (можно выбрать любые) по
 возрастанию , затем вывести
 в консоль, а затем отсортировать по убыванию и также вывести в консоль.
  Сортировка должна осуществляться
 методом «пузырька» https://ru.m.wikipedia.org/wiki/Сортировка_пузырьком
