// Работа с переменными

// 1) Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

// let name = 'Джон';
// let admin = name;
// alert(admin);

// 2 Придумайте правильные имена

// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

const ourPlanet = 'Земля';
const currentUser = '';

// 3

const BIRTHDAY = '18.04.1982'; // использовать заглавные буквы?

// Обычно мы используем буквы в верхнем регистре для констант, которые
//  «жёстко закодированы». Или, другими словами, когда значение известно до
//  выполнения скрипта и записывается непосредственно в код.

// В нашем примере, birthday именно такая переменная. Поэтому мы можем использовать
// заглавные буквы.