// Просто скину пару задачек для JS'еров.
// 1. Сложность: Easy.
// Что будет выведено в консоль и почему?
// console.log([1, 2, 3][3, 2, 1])

// 2. Сложность: Medium.
// Чему равен foo.x и bar?
// let foo = {n: 1}
// let bar = foo
// foo.x = foo = {n: 2}


// 3. Сложность: Medium/Hard.
// Напишите функцию вида add(num1)(num2), количество слогаемых неограниченно. В конце не должно быть лишних скобок с 0-м аргументов.

// 4. Сложность: Medium/Hard
// Что выведется в консоль и почему?
// let a = {},
//     b = {key: 'b'},
//     c = {key: 'c'}

// a[b] = 123
// a[c] = 456

// console.log(a[b])

// Я не умею определять сложности для подобных задач, потому тут меня можно, а вероятно и нужно поправить.